app/Http/Controllers/ClientesController.php

insert into `users` (`type_id`, `name`, `direccion`, `localidad`, `email`, `password`, `telefono`, `updated_at`, `created_at`) values (2, 'emiluchi', 'asdas', 'asdasdas', 'emiluchi@example.com', '$2y$12$WxRjkTLwweh720RrMrSTAOcD083wZuBWebnZurogyyeAXJowLofXa', '12312312', '2024-11-11 05:32:25', '2024-11-11 05:32:25')
---
    public function crear(Request $request)
    {


        $request->validate([
            'cliente_nombre' => ['required', 'max:255'],
            'cliente_direccion' => ['required', 'max:255'],
            'cliente_localidad' => ['required', 'max:255'],
            'cliente_email' => ['required', 'max:255', 'email', 'unique:cliente,cliente_email'],
            'cliente_password' => ['required', 'max:255'],
            'cliente_telefono' => ['required', 'max:255'],
        ]);

        $cliente = new User();
        $cliente->type_id = 2;
        $cliente->name    = $request->input('cliente_nombre');
        $cliente->direccion = $request->input('cliente_direccion');
        $cliente->localidad = $request->input('cliente_localidad');
        $cliente->email     = $request->input('cliente_email');
        $cliente->password  = $request->input('cliente_password');
        $cliente->telefono  = $request->input('cliente_telefono');
        $cliente->save();

        return response()->json(['status' => 'OK'], 200)
            ->cookie(
                'atemporal_token',          // Nombre de la cookie
                $cliente->createToken('accessToken')->plainTextToken,
                60,
                '/',
                config('session.domain'),
                false,
                true,
                false,
                'Lax'
            );

select * from "users" where "users"."id" = 12 and "users"."deleted_at" is null limit 1
---
    public function login(Request $request)
    {
        $cliente_email = $request->input('cliente_email');
        $cliente_password = $request->input('cliente_password');
        $auth = Auth::attempt([
            'email' => $cliente_email,
            'password' => $cliente_password,
        ]);

        if (!$auth) {
            abort(422);
        }
        $id = Auth::user()->id;

        $cliente = User::find($id);

insert into `venta` (`venta_fecha`, `cliente_id`, `updated_at`, `created_at`) values ('2024-11-11 05:32:31', 2, '2024-11-11 05:32:31', '2024-11-11 05:32:31')
insert into `venta_detalle` (`venta_id`, `venta_cantidad`, `producto_id`, `venta_precio`, `venta_total`, `updated_at`, `created_at`) values (1, 2, 1, 300, 600, '2024-11-11 05:32:31', '2024-11-11 05:32:31')
---
    public function carrito(Request $request)
    {
        $user = $request->user;
        $productos = $request->input('productos');
        $venta = new Venta();
        $venta->venta_fecha = Carbon::now();
        $venta->cliente_id = $request->user->id;
        $venta->save();

        foreach ($productos as $producto) {

            $ventaDetalle = new VentaDetalle();
            $ventaDetalle->venta_id = $venta->id;
            $ventaDetalle->venta_cantidad = $producto['cantidad'];
            $ventaDetalle->producto_id = $producto['id'];
            $ventaDetalle->venta_precio = $producto['producto_precio'];
            $ventaDetalle->venta_total = $producto['producto_precio'] * $producto['cantidad'];
            $ventaDetalle->save();