app/Http/Controllers/ProductosController.php

select * from `producto`
---
class ProductosController extends Controller
{
    Public function index(){
        $productos = Producto::all();